app/views/devise/registrations/edit.html.erb

SELECT `agencies`.* FROM `agencies`
---
      <%= f.label :agency_id %>
      <%= f.collection_select(:agency_id, Agency.all, :id, :name) %>