app/views/users/_form.html.erb

SELECT `agencies`.* FROM `agencies`  ORDER BY `agencies`.`name` ASC
---
          <%= f.label :agency_id %>
          <%= f.select :agency_id, Agency.order(:name).collect {|a| [ a.name, a.id ] }, {:include_blank => true}, {class: 'form-control input-lg floating-label', placeholder: 'Agency',  required: true }%>