app/controllers/agencies_controller.rb

SELECT `agencies`.* FROM `agencies`
---
  def index
    @agencies = Agency.all

INSERT INTO `agencies` (`type_of`, `name`, `dba`, `display_name`, `address1`, `address2`, `zip`, `email`, `phone`, `fax`, `created_at`, `updated_at`) VALUES ('', 'new agency', '', '', '', '', '', '', '', '', '2016-04-27 09:15:47', '2016-04-27 09:15:47')
---
  def create
    @agency = Agency.new(agency_params)

    respond_to do |format|
      if @agency.save

SELECT  `agencies`.* FROM `agencies` WHERE `agencies`.`id` = 2 LIMIT 1
---
    def set_agency
      @agency = Agency.find(params[:id])