app/controllers/indications_controller.rb

SELECT `indications`.* FROM `indications`
---
  def index
    @indications = Indication.all

INSERT INTO `indications` (`state`, `sub_out_commercial`, `sub_out_residential`, `description_of_operations`, `type_of_contractor`, `type_al_requested`, `limits_selected`, `insured_ops`, `limits`, `rating_factor`, `dba`, `name`, `zip`, `address1`, `address2`, `city`, `email`, `fax`, `phone`, `state_code`, `gf_comments`, `approval_comments`, `pdf_natural_url`, `pdf_tracking_url`, `effective_date`, `expire_date`, `created_at`, `updated_at`) VALUES ('', 0, 0, '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2016-04-27', '2016-04-27', '2016-04-27 10:22:31', '2016-04-27 10:22:31')
---
  def create
    @indication = Indication.new(indication_params)

    respond_to do |format|
      if @indication.save

SELECT  `indications`.* FROM `indications` WHERE `indications`.`id` = 1 LIMIT 1
---
    def set_indication
      @indication = Indication.find(params[:id])