app/controllers/policies_controller.rb

SELECT `policies`.* FROM `policies`
---
  def index
    @policies = Policy.all

INSERT INTO `policies` (`name`, `state`, `number`, `dba`, `phone`, `email`, `created_at`, `updated_at`) VALUES ('hey', '', '', '', '', '', '2016-04-27 11:46:07', '2016-04-27 11:46:07')
---
  def create
    @policy = Policy.new(policy_params)

    respond_to do |format|
      if @policy.save

SELECT  `policies`.* FROM `policies` WHERE `policies`.`id` = 1 LIMIT 1
---
    def set_policy
      @policy = Policy.find(params[:id])