app/controllers/users_controller.rb

UPDATE `users` SET `role` = NULL, `agency_id` = '', `facebook_user` = '', `twitter_handle` = '', `address_1` = '', `address_2` = '', `city` = '', `state` = '', `postal_code` = '', `phone_number` = '', `updated_at` = '2016-04-29 03:56:32' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)