app/controllers/user_profiles_controller.rb

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT 1  [["user_id", "1"]]
UPDATE "user_profiles" SET "facebook_user" = ?, "twitter_handle" = ?, "address_1" = ?, "address_2" = ?, "city" = ?, "state" = ?, "postal_code" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["facebook_user", ""], ["twitter_handle", ""], ["address_1", ""], ["address_2", ""], ["city", ""], ["state", ""], ["postal_code", ""], ["updated_at", "2016-03-18 16:47:57.669730"], ["id", 1]]
---
  def update
    @user_profile = current_user.user_profile
    if params[:user_profile][:picture] != nil
      uploaded_io = params[:user_profile][:picture]
      File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
        file.write(uploaded_io.read)
      end
    end
    respond_to do |format|
      if @user_profile.update(user_profile_params)

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT 1  [["user_id", "1"]]
---
    def set_user_profile
      @user_profile = UserProfile.find_by_user_id(params[:id])